import random
from django.shortcuts import render
from django.http import HttpResponse, JsonResponse
from django.shortcuts import render


def home(request):
    categories = [
        {"id": 1, "title": "Электроника", "url": "electro", "image": "img.jpeg"},
        {"id": 2, "title": "Ремонт", "url": "remont", "image": "img.jpeg"},
        {"id": 3, "title": "Детское", "url": "det", "image": "img.jpeg"},
        {"id": 4, "title": "Сувениры", "url": "suv", "image": "img.jpeg"},
    ]
    vip_ads = [
        {"id": 1, "seller": "Админ", "title": "Печка", "price": 1500.0, "category": "electro", "image": "img.jpeg"},
        {"id": 2, "seller": "User1", "title": "Шпатлёвка", "price": 500.0, "category": "remont", "image": "img.jpeg"},
        {"id": 3, "seller": "User2", "title": "Игрушка", "price": 1200.0, "category": "det", "image": "img.jpeg"},
        {"id": 4, "seller": "User2", "title": "Магнит", "price": 200.0, "category": "suv", "image": "img.jpeg"},
        {"id": 5, "seller": "User2", "title": "Магнит", "price": 200.0, "category": "suv", "image": "img.jpeg"},
    ]
    return render(
        request, 'home.html',
        context={"categories": categories, "vip_ads": vip_ads}
    )


def login(request):
    return render(request, 'login.html')
def register(request):
    return render(request, 'register.html')


def get_json(request):
    return JsonResponse(data={"name": random.randint(1, 100)}, safe=False)


# register
# login
# logout

# post_add


"""
* Размещение объявлений: пользователи должны иметь возможность размещать объявления на платформе, предоставляя информацию о товарах или услугах, которые они предлагают. В этом процессе пользователи должны иметь возможность загрузить фотографии, указать цену, категорию, описание и другие детали своих объявлений.
* Поиск объявлений: пользователи должны иметь возможность осуществлять поиск объявлений по категориям, ключевым словам и другим параметрам, чтобы быстро находить нужные им товары или услуги.
* Оплата и управление объявлениями: платформа должна иметь систему оплаты, чтобы пользователи могли оплатить размещение своих объявлений и получать доступ к дополнительным функциям. Кроме того, пользователи должны иметь возможность управлять своими объявлениями, включая редактирование, удаление и продление срока действия.
* Система обратной связи и поддержки: платформа должна предоставлять пользователю поддержку, чтобы помочь им в решении возникающих вопросов и проблем. Система обратной связи и обработки жалоб поможет пользователям своевременно реагировать на проблемы, которые могут возникнуть в процессе использования платформы.
* Аналитика: платформа должна предоставлять аналитические данные о популярности объявлений и другие данные для того, чтобы помочь пользователям оптимизировать свои объявления и улучшить их эффективность.
* Мобильная версия: веб-платформа должна иметь мобильную версию или приложение, чтобы пользователи могли удобно пользоваться ею на мобильных устройствах.
"""